#### Terraform dev Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.media_api.data.archive_file.media_uploads: Reading...
module.media_api.data.archive_file.media_uploads: Read complete after 0s [id=15641570fcec5080a0ecc56e2fb5ff9afc7a3790]
module.media_api.aws_cloudwatch_log_group.lambda["create_upload_record"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-create-upload-record]
module.media_storage.data.aws_caller_identity.current: Reading...
module.identity_pool.data.aws_region.current: Reading...
module.media_api.aws_iam_role.get_upload_records: Refreshing state... [id=cloud-photos-dev-get-upload-records-role]
module.media_api.aws_iam_role.delete_upload_record: Refreshing state... [id=cloud-photos-dev-delete-upload-record-role]
module.media_api.aws_cloudwatch_log_group.lambda["get_upload_records"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-get-upload-records]
module.media_api.aws_cloudwatch_log_group.lambda["delete_upload_record"]: Refreshing state... [id=/aws/lambda/cloud-photos-dev-delete-upload-record]
module.media_api.aws_iam_role.create_upload_record: Refreshing state... [id=cloud-photos-dev-create-upload-record-role]
module.media_db.aws_dynamodb_table.upload_records: Refreshing state... [id=cloud-photos-upload-records-dev]
module.cognito.aws_cognito_user_pool.main: Refreshing state... [id=ap-northeast-1_MqADoAEeB]
module.identity_pool.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.media_api.data.aws_caller_identity.current: Reading...
module.media_storage.data.aws_caller_identity.current: Read complete after 0s [id=***]
module.media_api.data.aws_region.current: Reading...
module.media_api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.media_api.aws_api_gateway_rest_api.media: Refreshing state... [id=vtz8vfq85g]
module.media_api.data.aws_caller_identity.current: Read complete after 0s [id=***]
module.media_storage.aws_s3_bucket.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.media_api.aws_iam_role_policy.delete_upload_record_logs: Refreshing state... [id=cloud-photos-dev-delete-upload-record-role:cloudwatch-logs]
module.media_api.aws_iam_role_policy.get_upload_records_logs: Refreshing state... [id=cloud-photos-dev-get-upload-records-role:cloudwatch-logs]
module.media_api.aws_iam_role_policy.create_upload_record_logs: Refreshing state... [id=cloud-photos-dev-create-upload-record-role:cloudwatch-logs]
module.cognito.aws_cognito_user_pool_client.main: Refreshing state... [id=3uf318v7h781gvs5rbrf7af932]
module.media_api.aws_api_gateway_resource.media: Refreshing state... [id=eh1ehu]
module.media_api.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-vtz8vfq85g-DEFAULT_5XX]
module.media_api.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-vtz8vfq85g-DEFAULT_4XX]
module.identity_pool.aws_cognito_identity_pool.main: Refreshing state... [id=ap-northeast-1:23316fc9-592e-4a7b-9a8a-c33a446faf78]
module.media_api.aws_api_gateway_resource.uploads: Refreshing state... [id=v3prx5]
module.media_api.aws_api_gateway_resource.upload_item: Refreshing state... [id=xbfdej]
module.media_api.aws_api_gateway_method.options_uploads: Refreshing state... [id=agm-vtz8vfq85g-v3prx5-OPTIONS]
module.media_api.aws_api_gateway_method.post_uploads: Refreshing state... [id=agm-vtz8vfq85g-v3prx5-POST]
module.media_api.aws_api_gateway_method.get_uploads: Refreshing state... [id=agm-vtz8vfq85g-v3prx5-GET]
module.media_api.aws_api_gateway_method_response.options_uploads: Refreshing state... [id=agmr-vtz8vfq85g-v3prx5-OPTIONS-200]
module.media_api.aws_api_gateway_integration.options_uploads: Refreshing state... [id=agi-vtz8vfq85g-v3prx5-OPTIONS]
module.media_api.aws_api_gateway_method.delete_upload: Refreshing state... [id=agm-vtz8vfq85g-xbfdej-DELETE]
module.media_api.aws_api_gateway_method.options_upload_item: Refreshing state... [id=agm-vtz8vfq85g-xbfdej-OPTIONS]
module.media_api.aws_iam_role_policy.create_upload_record_dynamodb: Refreshing state... [id=cloud-photos-dev-create-upload-record-role:dynamodb-put]
module.media_api.aws_iam_role_policy.delete_upload_record_dynamodb: Refreshing state... [id=cloud-photos-dev-delete-upload-record-role:dynamodb-delete]
module.media_api.aws_iam_role_policy.get_upload_records_dynamodb: Refreshing state... [id=cloud-photos-dev-get-upload-records-role:dynamodb-query]
module.media_api.aws_api_gateway_method_response.options_upload_item: Refreshing state... [id=agmr-vtz8vfq85g-xbfdej-OPTIONS-200]
module.media_api.aws_api_gateway_integration.options_upload_item: Refreshing state... [id=agi-vtz8vfq85g-xbfdej-OPTIONS]
module.media_api.aws_api_gateway_integration_response.options_uploads: Refreshing state... [id=agir-vtz8vfq85g-v3prx5-OPTIONS-200]
module.identity_pool.aws_iam_role.authenticated: Refreshing state... [id=cloud-photos-cognito-authenticated-dev]
module.media_api.aws_api_gateway_integration_response.options_upload_item: Refreshing state... [id=agir-vtz8vfq85g-xbfdej-OPTIONS-200]
module.identity_pool.aws_iam_role_policy.authenticated_api: Refreshing state... [id=cloud-photos-cognito-authenticated-dev:media-api-access]
module.identity_pool.aws_cognito_identity_pool_roles_attachment.main: Refreshing state... [id=ap-northeast-1:23316fc9-592e-4a7b-9a8a-c33a446faf78]
module.media_storage.aws_s3_bucket_public_access_block.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.media_storage.aws_s3_bucket_versioning.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.identity_pool.aws_iam_role_policy.authenticated_s3: Refreshing state... [id=cloud-photos-cognito-authenticated-dev:media-storage-access]
module.media_storage.aws_s3_bucket_server_side_encryption_configuration.media: Refreshing state... [id=***-cloud-photos-media-dev]
module.media_storage.aws_s3_bucket_lifecycle_configuration.media: Refreshing state... [id=***-cloud-photos-media-dev]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.media_api.aws_api_gateway_integration.options_upload_item has changed
  ~ resource "aws_api_gateway_integration" "options_upload_item" {
      + cache_key_parameters    = []
        id                      = "agi-vtz8vfq85g-xbfdej-OPTIONS"
      + request_parameters      = {}
        # (17 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_integration.options_uploads has changed
  ~ resource "aws_api_gateway_integration" "options_uploads" {
      + cache_key_parameters    = []
        id                      = "agi-vtz8vfq85g-v3prx5-OPTIONS"
      + request_parameters      = {}
        # (17 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_integration_response.options_upload_item has changed
  ~ resource "aws_api_gateway_integration_response" "options_upload_item" {
        id                  = "agir-vtz8vfq85g-xbfdej-OPTIONS-200"
      + response_templates  = {}
        # (8 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_integration_response.options_uploads has changed
  ~ resource "aws_api_gateway_integration_response" "options_uploads" {
        id                  = "agir-vtz8vfq85g-v3prx5-OPTIONS-200"
      + response_templates  = {}
        # (8 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_method.options_upload_item has changed
  ~ resource "aws_api_gateway_method" "options_upload_item" {
      + authorization_scopes = []
        id                   = "agm-vtz8vfq85g-xbfdej-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_method.options_uploads has changed
  ~ resource "aws_api_gateway_method" "options_uploads" {
      + authorization_scopes = []
        id                   = "agm-vtz8vfq85g-v3prx5-OPTIONS"
      + request_models       = {}
      + request_parameters   = {}
        # (9 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_method_response.options_upload_item has changed
  ~ resource "aws_api_gateway_method_response" "options_upload_item" {
        id                  = "agmr-vtz8vfq85g-xbfdej-OPTIONS-200"
      + response_models     = {}
        # (6 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_method_response.options_uploads has changed
  ~ resource "aws_api_gateway_method_response" "options_uploads" {
        id                  = "agmr-vtz8vfq85g-v3prx5-OPTIONS-200"
      + response_models     = {}
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.media_api.aws_api_gateway_deployment.media will be created
  + resource "aws_api_gateway_deployment" "media" {
      + created_date = (known after apply)
      + id           = (known after apply)
      + region       = "ap-northeast-1"
      + rest_api_id  = "vtz8vfq85g"
      + triggers     = (known after apply)
    }

  # module.media_api.aws_api_gateway_gateway_response.default_4xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {
        id                  = "aggr-vtz8vfq85g-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_gateway_response.default_5xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_5xx" {
        id                  = "aggr-vtz8vfq85g-DEFAULT_5XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.media_api.aws_api_gateway_integration.delete_upload will be created
  + resource "aws_api_gateway_integration" "delete_upload" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "DELETE"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = "xbfdej"
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "vtz8vfq85g"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.media_api.aws_api_gateway_integration.get_uploads will be created
  + resource "aws_api_gateway_integration" "get_uploads" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = "v3prx5"
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "vtz8vfq85g"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.media_api.aws_api_gateway_integration.post_uploads will be created
  + resource "aws_api_gateway_integration" "post_uploads" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = "v3prx5"
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "vtz8vfq85g"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.media_api.aws_api_gateway_stage.media will be created
  + resource "aws_api_gateway_stage" "media" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + region        = "ap-northeast-1"
      + rest_api_id   = "vtz8vfq85g"
      + stage_name    = "dev"
      + tags_all      = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + web_acl_arn   = (known after apply)
    }

  # module.media_api.aws_lambda_function.create_upload_record will be created
  + resource "aws_lambda_function" "create_upload_record" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/media_api/../../.build/media_uploads.zip"
      + function_name                  = "cloud-photos-dev-create-upload-record"
      + handler                        = "create_upload_record.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::***:role/cloud-photos-dev-create-upload-record-role"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "jIFFx1Cwys6d9dws3ABiSFwmrzkpWhj5ETNBHLiaZgI="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "cloud-photos-upload-records-dev"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.media_api.aws_lambda_function.delete_upload_record will be created
  + resource "aws_lambda_function" "delete_upload_record" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/media_api/../../.build/media_uploads.zip"
      + function_name                  = "cloud-photos-dev-delete-upload-record"
      + handler                        = "delete_upload_record.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::***:role/cloud-photos-dev-delete-upload-record-role"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "jIFFx1Cwys6d9dws3ABiSFwmrzkpWhj5ETNBHLiaZgI="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "cloud-photos-upload-records-dev"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.media_api.aws_lambda_function.get_upload_records will be created
  + resource "aws_lambda_function" "get_upload_records" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/media_api/../../.build/media_uploads.zip"
      + function_name                  = "cloud-photos-dev-get-upload-records"
      + handler                        = "get_upload_records.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::***:role/cloud-photos-dev-get-upload-records-role"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "jIFFx1Cwys6d9dws3ABiSFwmrzkpWhj5ETNBHLiaZgI="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cloud-photos"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "cloud-photos-upload-records-dev"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.media_api.aws_lambda_permission.delete_upload will be created
  + resource "aws_lambda_permission" "delete_upload" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-photos-dev-delete-upload-record"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:***:vtz8vfq85g/*/DELETE/media/uploads/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.media_api.aws_lambda_permission.get_uploads will be created
  + resource "aws_lambda_permission" "get_uploads" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-photos-dev-get-upload-records"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:***:vtz8vfq85g/*/GET/media/uploads"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.media_api.aws_lambda_permission.post_uploads will be created
  + resource "aws_lambda_permission" "post_uploads" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cloud-photos-dev-create-upload-record"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:***:vtz8vfq85g/*/POST/media/uploads"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

Plan: 11 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + media_api_endpoint        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<!-- terraform-plan-dev -->